In [1]:
import pandas as pd

In [2]:
###Create a dictionary with list values and convert it to a dataframe

In [3]:
data = {'oranges' : [2,8,9,6,7], 'apple' : [3,8,2,1,6], 'banana' : [5,6,1,3,2]}

In [4]:
data

{'oranges': [2, 8, 9, 6, 7],
 'apple': [3, 8, 2, 1, 6],
 'banana': [5, 6, 1, 3, 2]}

In [7]:
df1 = pd.DataFrame(data, index = ['Jane', 'Brian', 'Lily', 'Carol', 'Evans'])

In [8]:
df1

       oranges  apple  banana
Jane         2      3       5
Brian        8      8       6
Lily         9      2       1
Carol        6      1       3
Evans        7      6       2

In [9]:
type(df1)

pandas.core.frame.DataFrame

###Different ways to access a DataFrame object column

In [13]:
a = df1['apple']

In [14]:
type (a)

pandas.core.series.Series

In [19]:
#Explore inbuilt methods in both Dataframe and Series

In [20]:
c = df1.columns

In [21]:
type(c)

pandas.core.indexes.base.Index

In [22]:
c1 = list (c)

In [23]:
type (c1)

list

In [24]:
c1

['oranges', 'apple', 'banana']

In [48]:
df1

       oranges  lemon  banana
Jane         2      3       5
Brian        8      8       6
Lily         9      2       1
Carol        6      1       3
Evans        7      6       2

In [49]:
df2 = df1.rename({'apple':'lemon'},axis='columns', inplace = True)

In [50]:
df2

In [53]:
o = df1 ['oranges']

In [55]:
o.Evans

7

In [70]:
m= df1.loc['Evans',['lemon', 'banana']]

In [71]:
m

lemon     6
banana    2
Name: Evans, dtype: int64

In [73]:
m = df1.iloc[0]

In [74]:
m

oranges    2
lemon      3
banana     5
Name: Jane, dtype: int64

In [76]:
m= df1.iloc[[0]]

In [77]:
m

      oranges  lemon  banana
Jane        2      3       5

In [78]:
m= df1.iloc[[0,1]]

In [79]:
m

       oranges  lemon  banana
Jane         2      3       5
Brian        8      8       6

In [80]:
m = df1.iloc[:3]

In [81]:
m

       oranges  lemon  banana
Jane         2      3       5
Brian        8      8       6
Lily         9      2       1

In [99]:
m = df1.iloc[4,2]

m

In [100]:
m

2

In [102]:
m1=df1.iloc [1:3, 0:3]

In [103]:
m1

       oranges  lemon  banana
Brian        8      8       6
Lily         9      2       1

In [104]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    index=['cobra', 'viper', 'sidewinder'],
    columns=['max_speed', 'shield'])

In [105]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [107]:
df1 = df.loc['cobra':'viper', 'max_speed']

In [108]:
df1

cobra    1
viper    4
Name: max_speed, dtype: int64

In [121]:
df1 = df.loc[['viper','sidewinder'],['shield']]=50

In [122]:
df1

50

In [123]:
df1

50

In [124]:
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

In [125]:
df1 = df.loc[:, 'max_speed']= 40

In [126]:
df1

40

In [127]:
df

            max_speed  shield
cobra              40       2
viper              40      50
sidewinder         40      50